{
  "01": {
    "title": "CHOOSE TO INTERACT",
    "type": "choice",
    "choices": [
      {"text": "VIEW DESCRIPTION", "go_to": "02"},
      {"text": "ASK ABOUT HAIR COLOR", "go_to": "03"},
      {"text": "ASK ABOUT PARENTS", "go_to": "04"},
      {"text": "ASK ABOUT ROPE IN THE WARDROBE", "go_to": "05"},
      {"text": "ASK ABOUT PROJECT BRAVE NEW WORLD", "go_to": "06"},
      {"text": "CONFRONT", "go_to": "07"}
    ],
    "role": "pink_hair_boy"
  },
  "02": {
    "type": "description",
    "text": "BOY WITH NEON PINK HAIR."
  },
  "03": {
    "type": "dialog",
    "text": ["It’s called ASH BROWN, I’m trendy!"]
  },
  "04": {
    "type": "dialog",
    "text": ["My parents are always somewhere outside the country. I live by myself."]
  },
  "05": {
    "type": "dialog",
    "text": ["What rope? Where?"]
  },
  "06": {
    "type": "dialog",
    "text": ["That’s how rich people resolve conflicts nowadays, huh? Those hypocrites, ha! If everyone can afford their service then I do agree with their ideals tho..."]
  },
  "07": {
    "type": "game",
    "text": ["I said GET OUT. Well, since you don’t do it yourself, I’ll have to make you leave! "],
    "name": "combat"
  },
  "08": {
    "type": "dialog",
    "text": ["...",
      "I don’t understand...",
    "I thought we were friends...",
    "But turned out he was one of them...making fun of me, calling me names, destroying my stuff, slapping and kicking me…",
    "I don’t understand...all those things just don't make any sense AT ALL.",
    "HE WAS THE ONE THAT ASKED ME TO BE HIS FRIEND!",
    "He was always there when I was depressed and scared and he was the only person that listened when I talked. He even told me I was his best friend...",
    "Unlike me, he was popular and had a lot of friends and was nice to everyone. He was perfect. I wanted to be just like him.",
    "He said I would be popular too if I dye my hair and people would stop bullying me and be friends with me. I told him I’m color-blind and couldn’t dye it myself, so he helped me.",
    "Then I went to school the other day everyone was staring at me laughing so hard, even the teachers laughed a little bit. I couldn’t figure out why so I asked him and he said it was just that people were jealous of my hair.",
    "I still can't believe he told such a ridiculous lie, as if he didn’t bother to convince me...",
      "I mean, even I wasn’t fooled by that. I was furious and was about to scream at him and even hit him-I was always a quiet kid, so you get how mad I was at that moment.",
    "That’s when he gave that smile.",
    "It was the sweetest and the most sincere smile I’ve ever seen.",
    "For a moment, I almost thought I was standing right in front of an angel.",
    "...",
    "Though I wanted to believe it was an accident but there really wasn’t any other way to think of it. He knew me so well and yet he made things worse...",
    "...",
    "It’s been a really long time since then. Why do you have to bring it all up again to hurt me...",
    "...",
    "For god’s sake, save your sympathy.",
    "YOU",
    "DISGUST",
    "ME",
    "I need some sleep. Now get out of my sight."]
  },
  "09": {
    "type": "description",
    "text": ""
  }
}